[A_NaturesVitality_Buff H7BaseBuff]
mName=""
mTooltip=""

[A_EarthScholar_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="大地学者"
mTooltip="土系法术的法力消耗降低 %special.norm%。"

[A_RockSolid_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="坚若盘石"
mTooltip="每施放一个土系法术，获得 %buff.buff.buff.buff.stat %ICON_DEFENSE 防御。持续到战斗结束。"

[A_EarthWisdom_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="大地智慧"
mTooltip="土系法术获得 %stat1 %stat1.icon 魔力。其他每个智慧类能力都会增加 %stat1 %stat1.icon 魔力到此加成中。"

[A_RockSolid_Buff H7BaseBuff]
mName="坚若盘石"
mTooltip=""

[A_MasterOfEarth_III_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="土系学识III"
mTooltip="%spell1.name 对建筑和敌方生物造成双倍伤害。\n%spell2.name 对中心格子的单位造成双倍伤害。"

[A_MasterOfEarth_I_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="土系学识I"
mTooltip="%spell1.name 现在对目标4x4区域内的生物施放。\n%spell2.name 现在对目标3x3区域内的生物施放。"


[A_RockSolid_Buff_Defense H7BaseBuff]
mName="坚若盘石"
mTooltip="%stat %ICON_DEFENSE 防御，持续到战斗结束。"

[A_Collapse_Ability H7HeroAbility]
mName="坍塌"
mTooltip="地动山摇对任何已受损的城墙造成双倍伤害。巨石利刺对中心格子的生物造成双倍伤害。"
[A_ImprovedTier1Spells_Ability H7HeroAbility]
mName="土系学识I"
mTooltip="%spell1.name 和 %spell2.name 现在对目标4x4区域内的生物施放。"
[A_ImprovedTier2Spells_Ability H7HeroAbility]
mName="土系学识II"
mTooltip="被大地缠绕影响的生物如果离开其格子，会受到土系魔法伤害。毒液喷射的持续时间增加到10回合。"
[A_ImprovedTier3Spells_Ability H7HeroAbility]
mName="土系学识III"
mTooltip="地动山摇对任何已受损的城墙造成双倍伤害。巨石利刺对中心格子的生物造成双倍伤害。"
[A_LingeringPoison_Ability H7HeroAbility]
mName="附骨剧毒"
mTooltip="离开毒雾蔓延区域的生物会获得“中毒”减益，在该生物回合开始时造成土系魔法伤害，持续1回合。"
[A_MassRegeneration_Ability H7HeroAbility]
mName="群体再生"
mTooltip="活力再生的目标为6x6区域内的所有友方生物。"
[A_MassStoneSkin_Ability H7HeroAbility]
mName="群体石肤"
mTooltip="护体石肤的目标为4x4区域内的所有友方生物。"
[A_PoisonousThorns_Ability H7HeroAbility]
mName="剧毒荆棘"
mTooltip="被大地缠绕影响的生物每移动一格都会受到土系魔法伤害。"

v1.35

[A_MasterOfEarth_II_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="土系学识II"
mTooltip="%spell1.name 在生物移动时额外造成 %spell1.spell.buff2.buff.d.min %spell1.spell.buff2.buff.d.icon 土系伤害。\n%spell2.name 现在持续到战斗结束。\n %spell3.name 从额外目标身上驱散1个正面效果。"

v1.37

[A_NaturesVitality_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="自然活力"
mTooltip="友方生物获得 %buff1.buff.stat 生命值。\n如果英雄拥有所需知识，则有几率学会一个新的4级土系法术。"

v1.41

[A_EarthMagic_Skill H7Skill]
mName="土系魔法"
mTooltip="允许你在魔法行会学习土系魔法学派的法术。改善并增强其效果。"
mDescriptions[0]="使土系法术更有效，并提高英雄的 %ICON_ARCANE_KNOWLEDGE 魔力。"
mDescriptions[1]=""
mDescriptions[2]="使土系法术更有效，并将英雄的 %ICON_ARCANE_KNOWLEDGE 魔力提高1点。\n英雄有几率学会一个新的1级土系法术。"
mDescriptions[3]="使土系法术更有效，并将英雄的 %ICON_ARCANE_KNOWLEDGE 魔力额外提高2点。\n如果英雄拥有所需知识，则有几率学会一个新的2级土系法术。"
mDescriptions[4]="使土系法术更有效，并将英雄的 %ICON_ARCANE_KNOWLEDGE 魔力额外提高3点。\n如果英雄拥有所需知识，则有几率学会一个新的3级土系法术。\n\n与大师级<font color="#00588BFF">命运</font>结合时，解锁<font color="#00FFCB44">协同能力</font>：命运之花。"